Eksplorasi Di Kelas

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\hp\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\hp\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\hp\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\hp\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [3]:
data = {
    'Tahun': [2008, 2009, 2010],
    'Cakupan': ['Kota Bandung', 'Prov. Jawa Barat', 'Nasional'],
    'Tingkat_Inflasi': [10.23, 2.02, 4.53]
}

df = pd.DataFrame(data)
print(df)

   Tahun           Cakupan  Tingkat_Inflasi
0   2008      Kota Bandung            10.23
1   2009  Prov. Jawa Barat             2.02
2   2010          Nasional             4.53

Filter Data

In [4]:
filtered_data = df[df['Cakupan'] == 'Kota Bandung']
print(filtered_data)

   Tahun       Cakupan  Tingkat_Inflasi
0   2008  Kota Bandung            10.23

Mengubah Format ke CSV

In [5]:
df.to_csv('output.csv', index=False)

Mencari Nilai Tertinggi

In [6]:
max_inflasi = df['Tingkat_Inflasi'].max()
min_inflasi = df['Tingkat_Inflasi'].min()

print(max_inflasi)
print(min_inflasi)

10.23
2.02

Mengurutkan Tingkatan dari Kecil Ke Besar

In [7]:
df_sorted = df.sort_values(by='Tingkat_Inflasi', ascending=True)
print(df_sorted)

   Tahun           Cakupan  Tingkat_Inflasi
1   2009  Prov. Jawa Barat             2.02
2   2010          Nasional             4.53
0   2008      Kota Bandung            10.23

Mengurutkan Tingkatan dari Besar Ke Kecil

In [8]:
df_sorted = df.sort_values(by='Tingkat_Inflasi', ascending=False)
print(df_sorted)

   Tahun           Cakupan  Tingkat_Inflasi
0   2008      Kota Bandung            10.23
2   2010          Nasional             4.53
1   2009  Prov. Jawa Barat             2.02

In [9]:
frequency_table = df['Tahun'].value_counts()
print(frequency_table)

Tahun
2008    1
2009    1
2010    1
Name: count, dtype: int64

In [10]:
range_inflasi = df['Tingkat_Inflasi'].max() - df['Tingkat_Inflasi'].min()
print(range_inflasi)

8.21

In [11]:
statistics = df.describe()
print(statistics)

        Tahun  Tingkat_Inflasi
count     3.0         3.000000
mean   2009.0         5.593333
std       1.0         4.207022
min    2008.0         2.020000
25%    2008.5         3.275000
50%    2009.0         4.530000
75%    2009.5         7.380000
max    2010.0        10.230000

In [12]:
correlation = df['Tingkat_Inflasi'].corr(df['Tahun'])
print(correlation)

-0.6774388302247065

===================================================================================================

Latihan Soal (Problem 1)

In [13]:
df = pd.read_csv("C:/Users/hp/Downloads/data cute.csv")
df

                          nama fakultas  nilai_mat  nilai_kim  nilai_fis
0         Farhan Fathur Rahman    FMIPA      57.21      34.14      38.93
1               Steven Margono    FMIPA      67.43      51.50      57.20
2                 Ryan Sentosa    SAPPK      90.62      37.38      40.73
3         Muhajah Babny Muslim    FMIPA      72.31      38.80      44.79
4             Alvin Natawiguna     FTSL      65.45      57.67      56.39
...                        ...      ...        ...        ...        ...
5130               Khoirrashif    SITHR      66.14      46.82      56.74
5131      Jefri Hendri Adriano     FTSL      53.68      34.74      33.76
5132               Iki Hidayat     FITB      69.63      35.04      37.65
5133  Muhammad Nashir Sitompul      FTI      79.69      39.06      50.17
5134     Billy Richardo Sagala     STEI      68.68      51.23      66.18

[5135 rows x 5 columns]

1. Menghitung Banyaknya Data

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5135 entries, 0 to 5134
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nama       5135 non-null   object
 1   fakultas   5135 non-null   object
 2   nilai_mat  5135 non-null   float64
 3   nilai_kim  5135 non-null   float64
 4   nilai_fis  5135 non-null   float64
dtypes: float64(3), object(2)
memory usage: 200.7+ KB

2. Menampilkan 10 Data Pertama

In [16]:
df.head(10)

                             nama fakultas  nilai_mat  nilai_kim  nilai_fis
0            Farhan Fathur Rahman    FMIPA      57.21      34.14      38.93
1                  Steven Margono    FMIPA      67.43      51.50      57.20
2                    Ryan Sentosa    SAPPK      90.62      37.38      40.73
3            Muhajah Babny Muslim    FMIPA      72.31      38.80      44.79
4                Alvin Natawiguna     FTSL      65.45      57.67      56.39
5                   Sasti Safitri     FTSL      60.58      41.91      51.55
6             Dani Yulianto Putra     FTSL      51.67      35.05      48.69
7  Nabila Febitsukarizky Bunyamin     FTTM      71.66      67.61      69.75
8             Ratna Siti Khodijah      FTI      73.06      59.16      59.48
9                    Gita Partiwi     FTSL      69.57      38.84      48.17

3. Menampilkan data 50-60

In [17]:
df[50:60]

                        nama fakultas  nilai_mat  nilai_kim  nilai_fis
50      Arief Syakur Sutedjo     FTTM      84.40      61.21      73.91
51         Fayi Raihan Saleh    FMIPA      60.62      32.57      42.34
52          Erna Kristiawati      FTI      67.48      46.78      52.30
53                    Albert    SAPPK      70.27      50.10      54.01
54  M Jazztyan Indra Pradana     STEI      53.40      43.06      60.30
55      Moch Ginanjar Busiri    FMIPA      74.29      38.44      49.15
56              Aisya Tamara     FITB      71.49      35.86      37.41
57        Tyas Arum Widayati    SAPPK      68.57      37.02      53.25
58                Arif Saleh      FTI     100.00      59.79      55.33
59     Windy Diwita Nisaekti      FTI      67.15      57.72      54.24

4. Menghitung banyaknya mahasiswa ditiap Fakultas

In [18]:
data_values = df['fakultas'].value_counts()
data_values

fakultas
FTI      834
STEI     777
FTSL     660
FMIPA    627
FTTM     579
FTMD     480
FITB     403
SAPPK    315
SITHR    282
SITHS    178
Name: count, dtype: int64

5. Hitung nilai korelasi antara nilai fisika dan kimia. Tentukan apakah berkorelasi lurus, terbalik, atau tidak berkorelasi.

In [19]:
korelasi = df["nilai_fis"].corr(df['nilai_kim'])
korelasi

np.float64(0.7988187423880274)

Jadi, Nilai korelasi antara nilai fisika dan kimia semakin mendekati 1, dua kolom berbanding lurus

Latihan Soal (Problem 2)

In [21]:
df = pd.read_csv("C:/Users/hp/Downloads/data cute.csv")
df

                          nama fakultas  nilai_mat  nilai_kim  nilai_fis
0         Farhan Fathur Rahman    FMIPA      57.21      34.14      38.93
1               Steven Margono    FMIPA      67.43      51.50      57.20
2                 Ryan Sentosa    SAPPK      90.62      37.38      40.73
3         Muhajah Babny Muslim    FMIPA      72.31      38.80      44.79
4             Alvin Natawiguna     FTSL      65.45      57.67      56.39
...                        ...      ...        ...        ...        ...
5130               Khoirrashif    SITHR      66.14      46.82      56.74
5131      Jefri Hendri Adriano     FTSL      53.68      34.74      33.76
5132               Iki Hidayat     FITB      69.63      35.04      37.65
5133  Muhammad Nashir Sitompul      FTI      79.69      39.06      50.17
5134     Billy Richardo Sagala     STEI      68.68      51.23      66.18

[5135 rows x 5 columns]

1. Tampilkan nilai matematika, fisika, dan kimia milik Tuan Leo.

In [22]:
data_nilai = df[df['nama'].str.contains('Leo', case = False)]
data_nilai

                             nama fakultas  nilai_mat  nilai_kim  nilai_fis
731          Dedy Leonardo Nadeak    SAPPK      66.71      39.86      43.26
895               Leonardus Kevin     FTSL      63.53      19.67      26.15
924                Adityo Leonard     FTMD      58.35      54.03      61.92
1454       Hansen Leonard Andreas     STEI      72.55      58.65      61.25
2487             Stephen Leonardo     STEI      68.48      29.11      49.60
2706             Dennis Corleon N     FITB      54.47      45.57      57.08
2936                 Nicholas Leo     FTTM      81.27      41.81      53.72
3246      Leonardus Richard Salim     STEI      79.14      46.49      52.71
3775  Jessica Christella Corleony    FMIPA      64.57      44.12      45.99
3972         Leonardi Edo Saputra    FMIPA      44.16      36.80      47.00

2. Mencari Nilai Fisika Tertinggi

In [21]:
nilai_tertinggi = df['nilai_fis'].max()
print(nilai_tertinggi)

92.57

Mengurutkan dari yang Tertinggi

In [23]:
fisika_sorted = df.sort_values(by='nilai_fis',ascending=False)
print(fisika_sorted)

                         nama fakultas  nilai_mat  nilai_kim  nilai_fis
1936  Yuniar Fazriani Rusmana     FITB      53.61      67.19      92.57
4145                    Grace    SAPPK      62.23      68.08      90.46
918            Siti Munawaroh     STEI      62.22      73.93      90.13
1147             Feruz Kausar     STEI      81.61      76.12      88.40
2074            Sandi Suryadi     STEI      79.17      73.81      86.83
...                       ...      ...        ...        ...        ...
372          Muhammad Syirazi      FTI      52.96       5.31      15.81
1445            Erwin Hariadi     STEI      87.95       2.09      14.43
4772     Emirza Faisal Dahlan    SITHS      72.59      14.19      12.94
3534          Evelyn Melindra     STEI      77.56       7.83      11.10
4459             Firda Amalia    FMIPA      95.58      10.10       9.11

[5135 rows x 5 columns]

Menampilkan 10 orang Nilai Fisika Tertinggi

In [24]:
nilai_fisika = fisika_sorted.head(10)
nilai_fisika

                         nama fakultas  nilai_mat  nilai_kim  nilai_fis
1936  Yuniar Fazriani Rusmana     FITB      53.61      67.19      92.57
4145                    Grace    SAPPK      62.23      68.08      90.46
918            Siti Munawaroh     STEI      62.22      73.93      90.13
1147             Feruz Kausar     STEI      81.61      76.12      88.40
2074            Sandi Suryadi     STEI      79.17      73.81      86.83
1855          Sukuanto Tanoto     FTTM      88.42      67.16      86.25
1701        Riyani Prima Dewi     FTSL      80.56      71.57      85.95
4858    Nafisa Meisa Iskandar     FTTM      64.28      59.48      85.59
1301      Ludya Nabila Chinta    FMIPA      69.25      72.21      84.89
2952         Adjie Wirandhana    FMIPA      77.62      71.64      84.65

3. Menampilkan 10 orang dengan nilai kimia tertinggi

In [25]:
nilai_tertinggi = df['nilai_kim'].max()
print(nilai_tertinggi)

81.5

Mengurutkan Nilai Kimia dari yang Tertinggi

In [26]:
kimia_sorted = df.sort_values(by='nilai_kim',ascending=False)
print(kimia_sorted)

                        nama fakultas  nilai_mat  nilai_kim  nilai_fis
2554    Faathir Reza Avicena     FTSL      57.12      81.50      78.68
2779    Dinda A A Z Mundakir     STEI      41.18      81.34      82.60
3544      Tammya Ayu Purnomo    SITHS      74.49      81.20      78.58
4934  Alyssa Nadhira Windari     FTMD      78.38      78.83      78.68
1137        Izni Nur Ibrahim     STEI      56.70      78.46      84.34
...                      ...      ...        ...        ...        ...
3534         Evelyn Melindra     STEI      77.56       7.83      11.10
2912    Yunita Indah Puspita     FTMD      77.06       7.16      18.99
4111          Swastika Utama     FTMD      86.51       6.67      23.16
372         Muhammad Syirazi      FTI      52.96       5.31      15.81
1445           Erwin Hariadi     STEI      87.95       2.09      14.43

[5135 rows x 5 columns]

Dan Menampilkan Urutan 10 Orang dengan Nilai Kimia Tertinggi

In [27]:
nilai_kimia = kimia_sorted.head(10)
nilai_kimia

                          nama fakultas  nilai_mat  nilai_kim  nilai_fis
2554      Faathir Reza Avicena     FTSL      57.12      81.50      78.68
2779      Dinda A A Z Mundakir     STEI      41.18      81.34      82.60
3544        Tammya Ayu Purnomo    SITHS      74.49      81.20      78.58
4934    Alyssa Nadhira Windari     FTMD      78.38      78.83      78.68
1137          Izni Nur Ibrahim     STEI      56.70      78.46      84.34
2262      Rinaldi Oky Setiawan     STEI      71.22      77.44      83.66
4070      Ias Azhari Rezkyarno    FMIPA      62.85      76.90      81.52
2945           Klara Petra T T     FTSL      73.39      76.61      78.12
1788  Naudy Germanimo Laksmana     FTMD      62.29      76.38      76.15
1310       Mardliyahtur Rohmah     STEI      63.15      76.36      74.06

4. Banyaknya Nilai Matematika dibawah 50

In [28]:
nilai_mat = df[df['nilai_mat'] < 50]
print(nilai_mat)

                      nama fakultas  nilai_mat  nilai_kim  nilai_fis
63        Fidelis Elizabet    FMIPA      41.88      53.44      52.51
81                   Kevin     FTSL      48.18      24.89      32.12
83            Melinda Waty     STEI      44.69      42.34      39.49
91    Andi Bhatara Zharfan    SITHS      33.63      24.74      30.10
94          Wawan Hermawan     FTMD      45.34      34.56      45.56
...                    ...      ...        ...        ...        ...
5039   Jhon Victor Siahaan    FMIPA      42.60      49.84      59.50
5047    Dhiya Fajri Sadida     STEI      49.56      55.39      68.07
5063       Ahmad Puji Ardi    SITHR      42.10      35.37      31.05
5100        Novita Wahyuni     STEI      45.23      28.35      37.38
5122     Dharmawan Raharjo     STEI      42.16      42.15      52.73

[329 rows x 5 columns]

5. Banyaknya Mahasiswa di FMIPA

In [29]:
data_fmipa = df[df['fakultas'] == 'FMIPA']
data_fmipa

                         nama fakultas  nilai_mat  nilai_kim  nilai_fis
0        Farhan Fathur Rahman    FMIPA      57.21      34.14      38.93
1              Steven Margono    FMIPA      67.43      51.50      57.20
3        Muhajah Babny Muslim    FMIPA      72.31      38.80      44.79
17              Diana Octavia    FMIPA      84.23      31.62      36.46
20                 Abdul Azis    FMIPA      90.14      31.05      49.40
...                       ...      ...        ...        ...        ...
5083          Adithya Prabowo    FMIPA      69.73      51.83      66.14
5084    Mutawakil Al Muqadasi    FMIPA      69.90      52.45      65.73
5098  Nurul Rahma Kurnia Sari    FMIPA      80.00      48.26      57.37
5104    Rifki Wahyu Kurnianto    FMIPA      81.35      29.28      39.76
5123      Siti Vivi Octaviany    FMIPA      72.85      64.49      69.56

[627 rows x 5 columns]